---------------------------------------------------------------------------------------------
-- 姓名：陈胜
-- 日期：2018年3月20日
-- 功能：场景定义
-- 备注： 
---------------------------------------------------------------------------------------------
local M = {}

---------------------------------------------------------------------------------------------
-- 静态数据
-- @name 界面名字
-- @class 类名
-- @backgroundMusicId 背景音乐id
-- @forever 永久存在

-- @obj字段不能用
---------------------------------------------------------------------------------------------
M.interfaceInfo = {
	SceneMain = {class = require("View.Scene.SceneMain"), backgroundMusicId = 10004, forever = false}, -- 主场景
	SceneLogin = {class = require("View.Scene.SceneLogin"), backgroundMusicId = 10002, forever = false}, -- 登录场景
}

return M