---------------------------------------------------------------------------
--
-- 此文件是自动生成的，禁止手动修改！
--
---------------------------------------------------------------------------

local M = {
	field1 = {
		id = "field1", data = "10", 
	},
	field2 = {
		id = "field2", data = "99", 
	},
	field3 = {
		id = "field3", data = "600", 
	},
	field4 = {
		id = "field4", data = "10", 
	},
	field5 = {
		id = "field5", data = "99", 
	},
	field6 = {
		id = "field6", data = "3600", 
	},
	field7 = {
		id = "field7", data = "999999", 
	},
}

---------------------------------------------------------------------------------------------
-- 空值检测
---------------------------------------------------------------------------------------------
setmetatable(M, {__index = function (t, key)
	error(string.format("配置表discreteData.xlsx不存在id = %s !", key))
end})

return M