-----------------------------------------------------------------
--  姓名：陈胜
--  功能：全局变量
--  日期：2016年7月27日
--  备注：啦啦啦
-----------------------------------------------------------------
setmetatable(_G, { })
---------------------------------------------------------------------------------------------
----------------------------------------start------------------------------------------------
---------------------------------------------------------------------------------------------
RESOURCES_TYPE = {
	LOCAL = 0, -- 散图
	PLIST = 1, -- 合图
}

BUTTON_SOUND = 20001 -- 按钮默认音效


 VIEW_RAD = 0 -- 视角角度

 MAX_SCALE = 1.5 --拉近最大放大倍数
 INIT_DIS = 5 --初始距离
 MIN_DIS = 2.5 -- 最远距离
 MAX_DIS = 7.5 --最近距离
 DIS_ADD = 0.1 -- 每帧距离变化量
 

 GRAVITY = 0 -- 重力
 ADD_SPEED = 1 --每帧的加速度
 SPEED_ADD = 20 -- 纵向速度增加量
 SPACE_DIS = 16 -- 航道距离

BGHEIGHT = 2160 --背景高度
BGWIDTH = 9600 --背景宽度

ACTION_DELAY_TIME = 0.15 --动作比音乐延迟的时间，单位秒
TOUCH_TIME = 20/1000 --轻点响应时间
LONG_TOUCH_TIME = 100/1000 -- 长按响应时间
MOVE_TOUCH_TIME = 40/1000 -- 滑动响应时间
MOVE_TOUCH_DIS = 32 --滑动响应距离

HTTP_RESPONSE_SUCC = "SUCC"
HTTP_RESPONSE_FAIL = "FAIL"

POPUP_SELECT_EVENT_TYPE_YES = 1;
POPUP_SELECT_EVENT_TYPE_NO = 2;
POPUP_SELECT_EVENT_TYPE_OTHER = 3;
POPUP_SELECT_EVENT_TYPE_CLOSE = 4;



COLOR  = {
	TIP = cc.c3b(255, 153, 0),
}
---------------------------------------------------------------------------------------------
-----------------------------------------end-------------------------------------------------
---------------------------------------------------------------------------------------------
if CC_DISABLE_GLOBAL then
    cc.disable_global()
end